#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
/infra/instances/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/actions-hero/actions-hero/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/actions-hero/actions-hero

To view this run in a browser, visit:
https://app.terraform.io/app/metaroon/staging/runs/run-4PEjhCVof7FQXWq5

Waiting for the plan to start...

Terraform v1.6.3
on linux_amd64
Initializing plugins and modules...
random_string.random: Refreshing state... [id=xf5cy3e1]
data.cloudflare_zone.my_zone: Reading...
google_compute_project_metadata.ssh_keys: Refreshing state... [id=academic-matter-404418]
google_compute_firewall.allow_http: Refreshing state... [id=projects/academic-matter-404418/global/firewalls/allow-http]
google_compute_firewall.allow_https: Refreshing state... [id=projects/academic-matter-404418/global/firewalls/allow-https]
google_compute_instance.staging_pr_demo: Refreshing state... [id=projects/academic-matter-404418/zones/us-central1-a/instances/staging-pr-xf5cy3e1]
data.cloudflare_zone.my_zone: Read complete after 1s [id=b34bba9f731ec054e6190e2b6ff57373]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.my_instance_dns will be created
  + resource "cloudflare_record" "my_instance_dns" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "staging-pr-xf5cy3e1"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "A"
      + value           = "34.134.213.135"
      + zone_id         = "b34bba9f731ec054e6190e2b6ff57373"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ public_domain_name = "staging-pr-xf5cy3e1.wisdomdemo.com" -> "staging-pr-xf5cy3e1.hal.ns.cloudflare.com"

```

</details>

*Pusher: @stoXmod, Action: `workflow_dispatch`*